app/Controllers/Buku.php

SELECT `buku`.*, AVG(peminjaman.rating) as rata_rating
FROM `buku`
LEFT JOIN `peminjaman` ON `peminjaman`.`id_buku` = `buku`.`id_buku`
GROUP BY `buku`.`id_buku`
ORDER BY `buku`.`id_buku` DESC
---
    public function index()
    {
        $db = \Config\Database::connect();
        $kategori_dipilih = $this->request->getVar('kategori');
        $keyword = $this->request->getVar('keyword');

        $builder = $db->table('buku');
        $builder->select('buku.*, AVG(peminjaman.rating) as rata_rating');
        $builder->join('peminjaman', 'peminjaman.id_buku = buku.id_buku', 'left');

        // Filter Kategori (Jika ada yang dipilih)
        if ($kategori_dipilih && $kategori_dipilih != 'Semua') {
            $builder->where('buku.kategori', $kategori_dipilih);
        }

        // Fitur Pencarian (Keyword)
        if ($keyword) {
            $builder->groupStart()
                    ->like('buku.judul', $keyword)
                    ->orLike('buku.penulis', $keyword)
                    ->groupEnd();
        }

        $builder->groupBy('buku.id_buku');
        $builder->orderBy('buku.id_buku', 'DESC');

        $data = [
            'buku'           => $builder->get()->getResultArray(),
            'kategori_aktif' => $kategori_dipilih ?: 'Semua',
            'keyword'        => $keyword
        ];