app/Controllers/InboxAnggota.php

    public function index()
    {
        $inboxModel = new InboxModel();
        $id_user = session()->get('id');

        $data = [
            'title' => 'Kotak Pesan Anggota',
            'pesan' => $inboxModel->where('id_user', $id_user)
                                  ->orderBy('id_inbox', 'DESC')
                                  ->findAll()
---
SELECT *
FROM `inbox`
WHERE `id_user` = '6'
ORDER BY `id_inbox` DESC