app/Controllers/Peminjaman.php

    public function index()
    {
        $data['title'] = 'Manajemen Transaksi Perpustakaan';
        $data['peminjaman'] = $this->pModel->select('peminjaman.*, users.nama, buku.judul')
            ->join('users', 'users.id = peminjaman.id_user')
            ->join('buku', 'buku.id_buku = peminjaman.id_buku')
            ->orderBy('peminjaman.id_pinjam', 'DESC')
            ->findAll();
---
SELECT `peminjaman`.*, `users`.`nama`, `buku`.`judul`
FROM `peminjaman`
JOIN `users` ON `users`.`id` = `peminjaman`.`id_user`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
ORDER BY `peminjaman`.`id_pinjam` DESC

    public function riwayat()
    {
        $id_user = session()->get('id');
        $data['title'] = 'Riwayat Sihir Saya';
        $data['riwayat'] = $this->pModel->select('peminjaman.*, buku.judul, buku.foto')
            ->join('buku', 'buku.id_buku = peminjaman.id_buku')
            ->where('peminjaman.id_user', $id_user)
            ->orderBy('peminjaman.id_pinjam', 'DESC')
            ->findAll();
---
SELECT `peminjaman`.*, `buku`.`judul`, `buku`.`foto`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
WHERE `peminjaman`.`id_user` = '6'
ORDER BY `peminjaman`.`id_pinjam` DESC